In [1]:
# https://beta.bls.gov/dataViewer/view;jsessionid=CABC201CD643E5C31B56321479FD40D8

In [11]:
import pandas as pd
from sqlalchemy import create_engine

In [12]:
# The path to our CSV file
CPIfile = "Resources/CPI_2007_2019.csv"

# Read our Kickstarter data into pandas
df = pd.read_csv(CPIfile)
df.head()

     Series ID  Year Period    Value
0  CUUR0000SA0  2007    M01  202.416
1  CUUR0000SA0  2007    M02  203.499
2  CUUR0000SA0  2007    M03  205.352
3  CUUR0000SA0  2007    M04  206.686
4  CUUR0000SA0  2007    M05  207.949

In [14]:
df['date'] = pd.date_range(start='1/1/2007', periods=len(df), freq='MS')

In [15]:
df.head()

     Series ID  Year Period    Value       date
0  CUUR0000SA0  2007    M01  202.416 2007-01-01
1  CUUR0000SA0  2007    M02  203.499 2007-02-01
2  CUUR0000SA0  2007    M03  205.352 2007-03-01
3  CUUR0000SA0  2007    M04  206.686 2007-04-01
4  CUUR0000SA0  2007    M05  207.949 2007-05-01

In [16]:
print(df.dtypes)

Series ID            object
Year                  int64
Period               object
Value               float64
date         datetime64[ns]
dtype: object

In [17]:
df.rename(columns = {'date':'Date', 'Value':'CPI'}, inplace = True) 
df.head()

     Series ID  Year Period      CPI       Date
0  CUUR0000SA0  2007    M01  202.416 2007-01-01
1  CUUR0000SA0  2007    M02  203.499 2007-02-01
2  CUUR0000SA0  2007    M03  205.352 2007-03-01
3  CUUR0000SA0  2007    M04  206.686 2007-04-01
4  CUUR0000SA0  2007    M05  207.949 2007-05-01

In [19]:
CPI = df.copy()
CPI = CPI[['Date', 'CPI']]
CPI.head()

        Date      CPI
0 2007-01-01  202.416
1 2007-02-01  203.499
2 2007-03-01  205.352
3 2007-04-01  206.686
4 2007-05-01  207.949

In [23]:
connection_string = "postgres: @localhost:5432/border_db"
engine = create_engine(f'postgresql://{connection_string}')

In [24]:
# Use pandas to load Dataframe into the database
CPI.to_sql(name='cpi', con=engine, if_exists='append', index=False)

In [25]:
pd.read_sql_query('select * from cpi', con=engine).head()

   ID        Date      CPI
0   1  2009-01-01  211.143
1   2  2009-02-01  212.193
2   3  2009-03-01  212.709
3   4  2009-04-01  213.240
4   5  2009-05-01  213.856